### 1. Write a PySpark program to create a DataFrame with four columns: “name”, “age”, “city”, and “gender” and perform the following operations:
### • Insert minimum 10 values for the given columns.
### • Filter rows with age greater than 30.
### • Add a new column named it “tax”.
### • Rename the “age” column to “years”.
### • Drop Multiple Columns from the given data frame.

In [1]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import col,lit

In [2]:
spark = SparkSession.builder.appName("Program 1").getOrCreate()

In [3]:
columns=["Name", "Age", "City", "Gender"]

#### • Insert minimum 10 values for the given columns.

In [4]:
data = [
    ("Alice", 25, "New York", "Female"),
    ("Bob", 35, "Los Angeles", "Male"),
    ("Charlie", 45, "Chicago", "Male"),
    ("Diana", 29, "Houston", "Female"),
    ("Eve", 31, "Phoenix", "Female"),
    ("Frank", 40, "San Francisco", "Male"),
    ("Grace", 28, "Seattle", "Female"),
    ("Hank", 33, "Boston", "Male"),
    ("Ivy", 37, "Miami", "Female"),
    ("Jack", 50, "Denver", "Male")
]

In [5]:
df=spark.createDataFrame(data, columns)

In [6]:
print("Initial DataFrame")
df.show()

Initial DataFrame
+-------+---+-------------+------+
|   Name|Age|         City|Gender|
+-------+---+-------------+------+
|  Alice| 25|     New York|Female|
|    Bob| 35|  Los Angeles|  Male|
|Charlie| 45|      Chicago|  Male|
|  Diana| 29|      Houston|Female|
|    Eve| 31|      Phoenix|Female|
|  Frank| 40|San Francisco|  Male|
|  Grace| 28|      Seattle|Female|
|   Hank| 33|       Boston|  Male|
|    Ivy| 37|        Miami|Female|
|   Jack| 50|       Denver|  Male|
+-------+---+-------------+------+

#### • Filter rows with age greater than 30.

In [8]:
age_greater_than_30 = df.filter(col("Age")>30)

In [29]:
print("Rows with age greater than 30")
age_greater_than_30.show()

Rows with age greater than 30
+-------+---+-------------+------+
|   Name|Age|         City|Gender|
+-------+---+-------------+------+
|    Bob| 35|  Los Angeles|  Male|
|Charlie| 45|      Chicago|  Male|
|    Eve| 31|      Phoenix|Female|
|  Frank| 40|San Francisco|  Male|
|   Hank| 33|       Boston|  Male|
|    Ivy| 37|        Miami|Female|
|   Jack| 50|       Denver|  Male|
+-------+---+-------------+------+

#### • Add a new column named it “tax”.

In [22]:
df_with_tax=df.withColumn("Tax",lit(100))

In [28]:
print("Dataframe with tax as new column")
df_with_tax.show()

Dataframe with tax as new column
+-------+---+-------------+------+---+
|   Name|Age|         City|Gender|Tax|
+-------+---+-------------+------+---+
|  Alice| 25|     New York|Female|100|
|    Bob| 35|  Los Angeles|  Male|100|
|Charlie| 45|      Chicago|  Male|100|
|  Diana| 29|      Houston|Female|100|
|    Eve| 31|      Phoenix|Female|100|
|  Frank| 40|San Francisco|  Male|100|
|  Grace| 28|      Seattle|Female|100|
|   Hank| 33|       Boston|  Male|100|
|    Ivy| 37|        Miami|Female|100|
|   Jack| 50|       Denver|  Male|100|
+-------+---+-------------+------+---+

#### • Rename the “age” column to “years”.

In [24]:
renamed_df = df_with_tax.withColumnRenamed("Age","Years")

In [31]:
print("Column 'Age' renamed to 'Years'")
renamed_df.show()

Column 'Age' renamed to 'Years'
+-------+-----+-------------+------+---+
|   Name|Years|         City|Gender|Tax|
+-------+-----+-------------+------+---+
|  Alice|   25|     New York|Female|100|
|    Bob|   35|  Los Angeles|  Male|100|
|Charlie|   45|      Chicago|  Male|100|
|  Diana|   29|      Houston|Female|100|
|    Eve|   31|      Phoenix|Female|100|
|  Frank|   40|San Francisco|  Male|100|
|  Grace|   28|      Seattle|Female|100|
|   Hank|   33|       Boston|  Male|100|
|    Ivy|   37|        Miami|Female|100|
|   Jack|   50|       Denver|  Male|100|
+-------+-----+-------------+------+---+

#### • Drop Multiple Columns from the given data frame.

In [26]:
dropped_col_df=renamed_df.drop("Gender", "Tax")

In [32]:
print("DataFrames with 2 columns dropped - Gender and Tax")
dropped_col_df.show()

DataFrames with 2 columns dropped - Gender and Tax
+-------+-----+-------------+
|   Name|Years|         City|
+-------+-----+-------------+
|  Alice|   25|     New York|
|    Bob|   35|  Los Angeles|
|Charlie|   45|      Chicago|
|  Diana|   29|      Houston|
|    Eve|   31|      Phoenix|
|  Frank|   40|San Francisco|
|  Grace|   28|      Seattle|
|   Hank|   33|       Boston|
|    Ivy|   37|        Miami|
|   Jack|   50|       Denver|
+-------+-----+-------------+

In [33]:
spark.stop()